In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (1.2.4)
Requirement already satisfied: pytz>=2017.3 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/mikeygear/Library/Python/3.9/lib/python/site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in /Users/mikeygear/Library/Python/3.9/lib/python/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [2]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [3]:
pisa_df = pd.read_csv("PISA_SCORES_xl_clean.csv")
pisa_df.head()

        COUNTRY_NAME  READING_AVG  MATH_AVG  SCIENCE_AVG        ID
0       OECD average        487.0     489.0        489.0       NaN
1    B-S-J-Z (China)        555.0     591.0        590.0  CHN-BSJZ
2          Singapore        549.0     569.0        551.0       SGP
3      Macao (China)        525.0     558.0        544.0    CHN-MO
4  Hong Kong (China)        524.0     551.0        517.0   CHN-HKG

In [4]:
salaryRatio_df = pd.read_csv("salaryRatio_by_exp_clean.csv")
salaryRatio_df.head()

,COUNTRY_NAME,LS_15yrexp_to_perCapGDP,US_15yrexp_to_perCapGDP,LS_topscale_to_start,US_topscale_to_start,yrs_start_to_topSalary,ID
0,OECD,NaN,NaN,NaN,NaN,NaN,NaN
1,Australia,1.206361,1.206361,1.425063,1.425128,7.0,AUS
2,Austria,0.975104,1.067809,1.942419,2.067747,34.0,AUT
3,Belgium (Fl.),1.032397,1.032397,1.727457,1.727457,27.0,BEL-FL
4,Belgium (Fr.),0.999304,1.121943,1.722669,1.620292,27.0,BEL-FR

In [5]:
pisa_salary_ratio = pisa_df.merge(salaryRatio_df,how="inner")
pisa_salary_ratio.head()

,COUNTRY_NAME,READING_AVG,MATH_AVG,SCIENCE_AVG,ID,LS_15yrexp_to_perCapGDP,US_15yrexp_to_perCapGDP,LS_topscale_to_start,US_topscale_to_start,yrs_start_to_topSalary
0,B-S-J-Z (China),555.0,591.0,590.0,CHN-BSJZ,NaN,NaN,NaN,NaN,NaN
1,Singapore,549.0,569.0,551.0,SGP,1.119503,1.119503,3.013998,3.013998,NaN
2,Macao (China),525.0,558.0,544.0,CHN-MO,1.144100,1.144100,1.853916,1.853916,33.0
3,Hong Kong (China),524.0,551.0,517.0,CHN-HKG,NaN,NaN,NaN,NaN,NaN
4,Estonia,523.0,523.0,530.0,USSR-EST,NaN,NaN,NaN,NaN,NaN